; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
   ;; 色、木材種別、木材、機械
   acolour awood woodobj machine 
   ;; 表面状態 ワニスなどの状態
   surface treatmentstatus
   ;; 板のサイズ規格、パーツサイズ規格
   aboardsize apartsize - object
   highspeed-saw glazer grinder immersion-varnisher
   planer saw spray-varnisher - machine
   board part - woodobj)

  (:constants
   verysmooth smooth rough - surface
   ;; ニス、光ってる、なにもされてない、色がついてる?
   varnished glazed untreated colourfragments - treatmentstatus
   ;; 色
   natural - acolour
   small medium large - apartsize)

  (:predicates
   ;; 切り出されていない。
   (unused ?obj - part)
   ;; 機械の中に入っておらず、または切り出されており、手で操作することができる。
   (available ?obj - woodobj)

   (surface-condition ?obj - woodobj ?surface - surface)
   (treatment ?obj - part ?treatment - treatmentstatus)
   (colour ?obj - part ?colour - acolour)

   ;; 木の種類。
   (wood ?obj - woodobj ?wood - awood)
   (boardsize ?board - board ?size - aboardsize)
   (goalsize ?part - part ?size - apartsize)
   (boardsize-successor ?size1 ?size2 - aboardsize)

   (in-highspeed-saw ?b - board ?m - highspeed-saw)
   (empty ?m - highspeed-saw)
   ;; 機械に装填されている塗料の色
   (has-colour ?machine - machine ?colour - acolour)
   (contains-part ?b - board ?p - part)
   ;; grindによる順序を規定
   (grind-treatment-change ?old ?new - treatmentstatus)
   (is-smooth ?surface - surface))
  
  (:functions (total-cost) - number
              (spray-varnish-cost ?obj - part) - number
              (glaze-cost ?obj - part) - number
              (grind-cost ?obj - part) - number
              (plane-cost ?obj - part) - number)

  ;; immersion: (液体に)浸すこと.
  ;; varnish : ニス，ワニス.
  ;; 浸すことによって塗装+ニス。
  ;; 大きさによってコストが変わらないみたいだ。
  (:action do-immersion-varnish
           :parameters (?x - part ?m - immersion-varnisher 
                           ?newcolour - acolour ?surface - surface)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (surface-condition ?x ?surface)
                          (is-smooth ?surface)
                          (treatment ?x untreated))
           :effect (and
                    (increase (total-cost) 10) ;; コスト固定
                    (not (treatment ?x untreated))
                    (treatment ?x varnished)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  ;; スプレーによって塗装+ニス。
  (:action do-spray-varnish
           :parameters (?x - part ?m - spray-varnisher 
                           ?newcolour - acolour ?surface - surface)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (surface-condition ?x ?surface)
                          (is-smooth ?surface)
                          (treatment ?x untreated))
           :effect (and 
                    (increase (total-cost) (spray-varnish-cost ?x))
                    (not (treatment ?x untreated))
                    (treatment ?x varnished)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  

  ;;〈紙・布・皮などに〉光滑剤を塗る，つやつけをする.
  (:action do-glaze
           :parameters (?x - part ?m - glazer 
                           ?newcolour - acolour)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (treatment ?x untreated))
           :effect (and 
                    (increase (total-cost) (glaze-cost ?x))
                    (not (treatment ?x untreated))
                    (treatment ?x glazed)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  ;; 削ってverysmoothに。塗装をやり直し。色は消える。
  (:action do-grind
           :parameters (?x - part ?m - grinder ?oldsurface - surface
                           ?oldcolour - acolour 
                           ?oldtreatment ?newtreatment - treatmentstatus) 
           :precondition (and 
                          (available ?x)
                          (surface-condition ?x ?oldsurface)
                          (is-smooth ?oldsurface)
                          (colour ?x ?oldcolour)
                          (treatment ?x ?oldtreatment)
                          (grind-treatment-change ?oldtreatment ?newtreatment))
           :effect (and
                    (increase (total-cost) (grind-cost ?x))
                    (not (surface-condition ?x ?oldsurface))
                    (surface-condition ?x verysmooth)
                    (not (treatment ?x ?oldtreatment))
                    (treatment ?x ?newtreatment)
                    (not (colour ?x ?oldcolour))
                    (colour ?x natural)))

  ;; 削ってsmoothに。
  (:action do-plane
           :parameters (?x - part ?m - planer ?oldsurface - surface
                           ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
           :precondition (and 
                          (available ?x)
                          (surface-condition ?x ?oldsurface)
                          (treatment ?x ?oldtreatment)
                          (colour ?x ?oldcolour))
           :effect (and
                    (increase (total-cost) (plane-cost ?x))
                    (not (surface-condition ?x ?oldsurface))
                    (surface-condition ?x smooth)
                    (not (treatment ?x ?oldtreatment))
                    (treatment ?x untreated)
                    (not (colour ?x ?oldcolour))
                    (colour ?x natural)))

  ;; のこぎりで切る機械に入れる。
  (:action load-highspeed-saw
           :parameters (?b - board ?m - highspeed-saw)
           :precondition (and
                          (empty ?m)
                          (available ?b))
           :effect (and
                    (increase (total-cost) 30)
                    (not (available ?b))
                    (not (empty ?m))
                    (in-highspeed-saw ?b ?m)))
  
  ;; のこぎりで切る機械から取り出す。
  (:action unload-highspeed-saw
           :parameters (?b - board ?m - highspeed-saw)
           :precondition (in-highspeed-saw ?b ?m)
           :effect (and
                    (increase (total-cost) 10)
                    (available ?b)
                    (not (in-highspeed-saw ?b ?m))
                    (empty ?m)))
  
  ;; のこぎり機械に入っている場合、小さく切る。
  ;; do-saw-small と違って、時間は10しかかからない。
  ;; 
  (:action cut-board-small
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface ?size_before ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p small)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  ;; 中くらいに切る。
  (:action cut-board-medium
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p medium)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action cut-board-large
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?s2 ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p large)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?s2)
                          (boardsize-successor ?s2 ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  ;; 手で板を切り出す。板が大きかろうが小さかろうが30かかる
  ;; 板の大きさは小さくなる。(size_after になる)
  ;; ここらへんは do-saw-small/medium/large全部同じ。
  ;; largeを切りだそうとすると板が3段階小さくなる。
  (:action do-saw-small
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface ?size_before ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p small)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action do-saw-medium
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p medium)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action do-saw-large
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?s2 ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p large)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?s2)
                          (boardsize-successor ?s2 ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))
  )

; problem
; woodworking task with 20 parts and 140% wood
; Machines:
;   3 grinder
;   3 glazer
;   3 immersion-varnisher
;   3 planer
;   3 highspeed-saw
;   3 spray-varnisher
;   3 saw
; random seed: 684133

(define (problem wood-prob-sat-51)
  (:domain woodworking)
  (:objects
    grinder0 grinder1 grinder2 - grinder
    glazer0 glazer1 glazer2 - glazer
    immersion-varnisher0 immersion-varnisher1 immersion-varnisher2 - immersion-varnisher
    planer0 planer1 planer2 - planer
    highspeed-saw0 highspeed-saw1 highspeed-saw2 - highspeed-saw
    spray-varnisher0 spray-varnisher1 spray-varnisher2 - spray-varnisher
    saw0 saw1 saw2 - saw
    mauve black white red green blue - acolour
    oak teak walnut beech cherry - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 - part
    b0 b1 b2 b3 b4 b5 b6 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (boardsize-successor s9 s10)
    (has-colour glazer0 white)
    (has-colour glazer0 natural)
    (has-colour glazer1 blue)
    (has-colour glazer1 black)
    (has-colour glazer1 white)
    (has-colour glazer1 green)
    (has-colour glazer1 red)
    (has-colour glazer2 blue)
    (has-colour glazer2 natural)
    (has-colour glazer2 mauve)
    (has-colour glazer2 green)
    (has-colour glazer2 black)
    (has-colour glazer2 red)
    (has-colour immersion-varnisher0 mauve)
    (has-colour immersion-varnisher0 white)
    (has-colour immersion-varnisher1 blue)
    (has-colour immersion-varnisher1 mauve)
    (has-colour immersion-varnisher2 blue)
    (has-colour immersion-varnisher2 white)
    (has-colour immersion-varnisher2 green)
    (has-colour immersion-varnisher2 red)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (empty highspeed-saw2)
    (has-colour spray-varnisher0 mauve)
    (has-colour spray-varnisher0 white)
    (has-colour spray-varnisher0 red)
    (has-colour spray-varnisher1 blue)
    (has-colour spray-varnisher1 mauve)
    (has-colour spray-varnisher1 white)
    (has-colour spray-varnisher2 blue)
    (has-colour spray-varnisher2 mauve)
    (has-colour spray-varnisher2 white)
    (has-colour spray-varnisher2 green)
    (unused p0)
    (goalsize p0 large)
    (= (spray-varnish-cost p0) 15)
    (= (glaze-cost p0) 20)
    (= (grind-cost p0) 45)
    (= (plane-cost p0) 30)
    (unused p1)
    (goalsize p1 small)
    (= (spray-varnish-cost p1) 5)
    (= (glaze-cost p1) 10)
    (= (grind-cost p1) 15)
    (= (plane-cost p1) 10)
    (unused p2)
    (goalsize p2 large)
    (= (spray-varnish-cost p2) 15)
    (= (glaze-cost p2) 20)
    (= (grind-cost p2) 45)
    (= (plane-cost p2) 30)
    (available p3)
    (colour p3 green)
    (wood p3 oak)
    (surface-condition p3 rough)
    (treatment p3 varnished)
    (goalsize p3 large)
    (= (spray-varnish-cost p3) 15)
    (= (glaze-cost p3) 20)
    (= (grind-cost p3) 45)
    (= (plane-cost p3) 30)
    (unused p4)
    (goalsize p4 medium)
    (= (spray-varnish-cost p4) 10)
    (= (glaze-cost p4) 15)
    (= (grind-cost p4) 30)
    (= (plane-cost p4) 20)
    (unused p5)
    (goalsize p5 large)
    (= (spray-varnish-cost p5) 15)
    (= (glaze-cost p5) 20)
    (= (grind-cost p5) 45)
    (= (plane-cost p5) 30)
    (unused p6)
    (goalsize p6 large)
    (= (spray-varnish-cost p6) 15)
    (= (glaze-cost p6) 20)
    (= (grind-cost p6) 45)
    (= (plane-cost p6) 30)
    (available p7)
    (colour p7 natural)
    (wood p7 cherry)
    (surface-condition p7 verysmooth)
    (treatment p7 colourfragments)
    (goalsize p7 small)
    (= (spray-varnish-cost p7) 5)
    (= (glaze-cost p7) 10)
    (= (grind-cost p7) 15)
    (= (plane-cost p7) 10)
    (available p8)
    (colour p8 natural)
    (wood p8 beech)
    (surface-condition p8 rough)
    (treatment p8 colourfragments)
    (goalsize p8 small)
    (= (spray-varnish-cost p8) 5)
    (= (glaze-cost p8) 10)
    (= (grind-cost p8) 15)
    (= (plane-cost p8) 10)
    (unused p9)
    (goalsize p9 medium)
    (= (spray-varnish-cost p9) 10)
    (= (glaze-cost p9) 15)
    (= (grind-cost p9) 30)
    (= (plane-cost p9) 20)
    (unused p10)
    (goalsize p10 medium)
    (= (spray-varnish-cost p10) 10)
    (= (glaze-cost p10) 15)
    (= (grind-cost p10) 30)
    (= (plane-cost p10) 20)
    (unused p11)
    (goalsize p11 large)
    (= (spray-varnish-cost p11) 15)
    (= (glaze-cost p11) 20)
    (= (grind-cost p11) 45)
    (= (plane-cost p11) 30)
    (unused p12)
    (goalsize p12 medium)
    (= (spray-varnish-cost p12) 10)
    (= (glaze-cost p12) 15)
    (= (grind-cost p12) 30)
    (= (plane-cost p12) 20)
    (available p13)
    (colour p13 mauve)
    (wood p13 oak)
    (surface-condition p13 verysmooth)
    (treatment p13 varnished)
    (goalsize p13 large)
    (= (spray-varnish-cost p13) 15)
    (= (glaze-cost p13) 20)
    (= (grind-cost p13) 45)
    (= (plane-cost p13) 30)
    (unused p14)
    (goalsize p14 large)
    (= (spray-varnish-cost p14) 15)
    (= (glaze-cost p14) 20)
    (= (grind-cost p14) 45)
    (= (plane-cost p14) 30)
    (unused p15)
    (goalsize p15 small)
    (= (spray-varnish-cost p15) 5)
    (= (glaze-cost p15) 10)
    (= (grind-cost p15) 15)
    (= (plane-cost p15) 10)
    (unused p16)
    (goalsize p16 medium)
    (= (spray-varnish-cost p16) 10)
    (= (glaze-cost p16) 15)
    (= (grind-cost p16) 30)
    (= (plane-cost p16) 20)
    (available p17)
    (colour p17 black)
    (wood p17 oak)
    (surface-condition p17 rough)
    (treatment p17 glazed)
    (goalsize p17 medium)
    (= (spray-varnish-cost p17) 10)
    (= (glaze-cost p17) 15)
    (= (grind-cost p17) 30)
    (= (plane-cost p17) 20)
    (unused p18)
    (goalsize p18 large)
    (= (spray-varnish-cost p18) 15)
    (= (glaze-cost p18) 20)
    (= (grind-cost p18) 45)
    (= (plane-cost p18) 30)
    (unused p19)
    (goalsize p19 small)
    (= (spray-varnish-cost p19) 5)
    (= (glaze-cost p19) 10)
    (= (grind-cost p19) 15)
    (= (plane-cost p19) 10)
    (boardsize b0 s3)
    (wood b0 beech)
    (surface-condition b0 smooth)
    (available b0)
    (boardsize b1 s9)
    (wood b1 cherry)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s7)
    (wood b2 cherry)
    (surface-condition b2 rough)
    (available b2)
    (boardsize b3 s9)
    (wood b3 walnut)
    (surface-condition b3 smooth)
    (available b3)
    (boardsize b4 s10)
    (wood b4 walnut)
    (surface-condition b4 rough)
    (available b4)
    (boardsize b5 s6)
    (wood b5 oak)
    (surface-condition b5 rough)
    (available b5)
    (boardsize b6 s6)
    (wood b6 teak)
    (surface-condition b6 smooth)
    (available b6)
  )
  (:goal
    (and
      (available p0)
      (colour p0 mauve)
      (wood p0 cherry)
      (available p1)
      (colour p1 blue)
      (treatment p1 varnished)
      (available p2)
      (colour p2 white)
      (wood p2 cherry)
      (available p3)
      (colour p3 natural)
      (treatment p3 glazed)
      (available p4)
      (colour p4 green)
      (wood p4 beech)
      (surface-condition p4 smooth)
      (available p5)
      (colour p5 blue)
      (surface-condition p5 verysmooth)
      (treatment p5 varnished)
      (available p6)
      (colour p6 green)
      (wood p6 walnut)
      (treatment p6 glazed)
      (available p7)
      (wood p7 cherry)
      (surface-condition p7 smooth)
      (available p8)
      (colour p8 blue)
      (treatment p8 glazed)
      (available p9)
      (colour p9 red)
      (treatment p9 glazed)
      (available p10)
      (wood p10 cherry)
      (surface-condition p10 smooth)
      (treatment p10 varnished)
      (available p11)
      (colour p11 blue)
      (wood p11 teak)
      (surface-condition p11 verysmooth)
      (treatment p11 glazed)
      (available p12)
      (colour p12 white)
      (treatment p12 glazed)
      (available p13)
      (surface-condition p13 verysmooth)
      (treatment p13 glazed)
      (available p14)
      (colour p14 white)
      (wood p14 oak)
      (surface-condition p14 verysmooth)
      (treatment p14 varnished)
      (available p15)
      (colour p15 black)
      (treatment p15 glazed)
      (available p16)
      (colour p16 mauve)
      (wood p16 walnut)
      (surface-condition p16 smooth)
      (treatment p16 varnished)
      (available p17)
      (colour p17 red)
      (wood p17 oak)
      (available p18)
      (colour p18 mauve)
      (surface-condition p18 smooth)
      (treatment p18 varnished)
      (available p19)
      (colour p19 natural)
      (treatment p19 glazed)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-plane p8 planer0 rough natural colourfragments)
   deleted: (surface-condition p8 rough) (treatment p8 colourfragments)
   added: (surface-condition p8 smooth) (treatment p8 untreated)
   goals met: 8 of 71
2. (do-plane p7 planer0 verysmooth natural colourfragments)
   deleted: (surface-condition p7 verysmooth) (treatment p7 colourfragments)
   added: (surface-condition p7 smooth) (treatment p7 untreated)
   goals met: 9 of 71
3. (do-plane p3 planer0 rough green varnished)
   deleted: (surface-condition p3 rough) (treatment p3 varnished) (colour p3 green)
   added: (surface-condition p3 smooth) (treatment p3 untreated) (colour p3 natural)
   goals met: 10 of 71
4. (do-glaze p3 glazer0 natural)
   deleted: (treatment p3 untreated)
   added: (treatment p3 glazed)
   goals met: 11 of 71
5. (do-plane p17 planer0 rough black glazed)
   deleted: (surface-condition p17 rough) (treatment p17 glazed) (colour p17 black)
   added: (surface-condition p17 smooth) (treatment p17 untreated) (colour p17 natural)
   goals met: 11 of 71
6. (do-immersion-varnish p17 immersion-varnisher2 red smooth)
   deleted: (treatment p17 untreated) (colour p17 natural)
   added: (treatment p17 varnished) (colour p17 red)
   goals met: 12 of 71
7. (do-saw-large b2 p0 saw0 cherry rough s7 s5 s6 s4)
   deleted: (unused p0)
   added: (available p0) (wood p0 cherry) (surface-condition p0 rough) (colour p0 natural) (treatment p0 untreated) (boardsize b2 s4)
   goals met: 14 of 71
8. (do-saw-medium b2 p10 saw0 cherry rough s4 s3 s2)
   deleted: (unused p10)
   added: (available p10) (wood p10 cherry) (surface-condition p10 rough) (colour p10 natural) (treatment p10 untreated) (boardsize b2 s2)
   goals met: 16 of 71
9. (do-saw-large b6 p11 saw0 teak smooth s6 s4 s5 s3)
   deleted: (unused p11)
   added: (available p11) (wood p11 teak) (surface-condition p11 smooth) (colour p11 natural) (treatment p11 untreated) (boardsize b6 s3)
   goals met: 18 of 71
10. (do-saw-large b5 p14 saw0 oak rough s6 s4 s5 s3)
   deleted: (unused p14)
   added: (available p14) (wood p14 oak) (surface-condition p14 rough) (colour p14 natural) (treatment p14 untreated) (boardsize b5 s3)
   goals met: 20 of 71
11. (do-saw-medium b4 p16 saw0 walnut rough s10 s9 s8)
   deleted: (unused p16)
   added: (available p16) (wood p16 walnut) (surface-condition p16 rough) (colour p16 natural) (treatment p16 untreated) (boardsize b4 s8)
   goals met: 22 of 71
12. (do-saw-large b1 p2 saw0 cherry rough s9 s7 s8 s6)
   deleted: (unused p2)
   added: (available p2) (wood p2 cherry) (surface-condition p2 rough) (colour p2 natural) (treatment p2 untreated) (boardsize b1 s6)
   goals met: 24 of 71
13. (do-saw-medium b0 p4 saw0 beech smooth s3 s2 s1)
   deleted: (unused p4)
   added: (available p4) (wood p4 beech) (surface-condition p4 smooth) (colour p4 natural) (treatment p4 untreated) (boardsize b0 s1)
   goals met: 27 of 71
14. (do-saw-large b4 p6 saw0 walnut rough s8 s6 s7 s5)
   deleted: (unused p6)
   added: (available p6) (wood p6 walnut) (surface-condition p6 rough) (colour p6 natural) (treatment p6 untreated) (boardsize b4 s5)
   goals met: 29 of 71
15. (do-glaze p6 glazer1 green)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 glazed) (colour p6 green)
   goals met: 31 of 71
16. (do-saw-large b6 p5 saw0 teak smooth s3 s1 s2 s0)
   deleted: (unused p5)
   added: (available p5) (wood p5 teak) (surface-condition p5 smooth) (colour p5 natural) (treatment p5 untreated) (boardsize b6 s0)
   goals met: 32 of 71
17. (do-plane p13 planer0 verysmooth mauve varnished)
   deleted: (surface-condition p13 verysmooth) (treatment p13 varnished) (colour p13 mauve)
   added: (surface-condition p13 smooth) (treatment p13 untreated) (colour p13 natural)
   goals met: 31 of 71
18. (do-grind p13 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p13 smooth)
   added: (surface-condition p13 verysmooth)
   goals met: 32 of 71
19. (do-glaze p13 glazer0 natural)
   deleted: (treatment p13 untreated)
   added: (treatment p13 glazed)
   goals met: 33 of 71
20. (do-saw-medium b5 p9 saw0 oak rough s3 s2 s1)
   deleted: (unused p9)
   added: (available p9) (wood p9 oak) (surface-condition p9 rough) (colour p9 natural) (treatment p9 untreated) (boardsize b5 s1)
   goals met: 34 of 71
21. (do-glaze p9 glazer1 red)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 glazed) (colour p9 red)
   goals met: 36 of 71
22. (do-immersion-varnish p5 immersion-varnisher1 blue smooth)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 varnished) (colour p5 blue)
   goals met: 38 of 71
23. (do-immersion-varnish p4 immersion-varnisher2 green smooth)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 varnished) (colour p4 green)
   goals met: 39 of 71
24. (do-glaze p2 glazer0 white)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 glazed) (colour p2 white)
   goals met: 40 of 71
25. (do-saw-small b5 p19 saw0 oak rough s1 s0)
   deleted: (unused p19)
   added: (available p19) (wood p19 oak) (surface-condition p19 rough) (colour p19 natural) (treatment p19 untreated) (boardsize b5 s0)
   goals met: 42 of 71
26. (do-grind p5 grinder0 smooth blue varnished colourfragments)
   deleted: (surface-condition p5 smooth) (treatment p5 varnished) (colour p5 blue)
   added: (surface-condition p5 verysmooth) (treatment p5 colourfragments) (colour p5 natural)
   goals met: 41 of 71
27. (do-glaze p19 glazer0 natural)
   deleted: (treatment p19 untreated)
   added: (treatment p19 glazed)
   goals met: 42 of 71
28. (do-saw-large b4 p18 saw0 walnut rough s5 s3 s4 s2)
   deleted: (unused p18)
   added: (available p18) (wood p18 walnut) (surface-condition p18 rough) (colour p18 natural) (treatment p18 untreated) (boardsize b4 s2)
   goals met: 43 of 71
29. (do-plane p18 planer0 rough natural untreated)
   deleted: (surface-condition p18 rough)
   added: (surface-condition p18 smooth)
   goals met: 44 of 71
30. (do-immersion-varnish p18 immersion-varnisher0 mauve smooth)
   deleted: (treatment p18 untreated) (colour p18 natural)
   added: (treatment p18 varnished) (colour p18 mauve)
   goals met: 46 of 71
31. (do-plane p16 planer0 rough natural untreated)
   deleted: (surface-condition p16 rough)
   added: (surface-condition p16 smooth)
   goals met: 47 of 71
32. (do-immersion-varnish p16 immersion-varnisher0 mauve smooth)
   deleted: (treatment p16 untreated) (colour p16 natural)
   added: (treatment p16 varnished) (colour p16 mauve)
   goals met: 49 of 71
33. (do-saw-small b4 p15 saw0 walnut rough s2 s1)
   deleted: (unused p15)
   added: (available p15) (wood p15 walnut) (surface-condition p15 rough) (colour p15 natural) (treatment p15 untreated) (boardsize b4 s1)
   goals met: 50 of 71
34. (do-glaze p15 glazer1 black)
   deleted: (treatment p15 untreated) (colour p15 natural)
   added: (treatment p15 glazed) (colour p15 black)
   goals met: 52 of 71
35. (do-plane p14 planer0 rough natural untreated)
   deleted: (surface-condition p14 rough)
   added: (surface-condition p14 smooth)
   goals met: 52 of 71
36. (do-immersion-varnish p14 immersion-varnisher0 white smooth)
   deleted: (treatment p14 untreated) (colour p14 natural)
   added: (treatment p14 varnished) (colour p14 white)
   goals met: 54 of 71
37. (do-saw-medium b3 p12 saw0 walnut smooth s9 s8 s7)
   deleted: (unused p12)
   added: (available p12) (wood p12 walnut) (surface-condition p12 smooth) (colour p12 natural) (treatment p12 untreated) (boardsize b3 s7)
   goals met: 55 of 71
38. (do-grind p11 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p11 smooth)
   added: (surface-condition p11 verysmooth)
   goals met: 56 of 71
39. (do-plane p10 planer0 rough natural untreated)
   deleted: (surface-condition p10 rough)
   added: (surface-condition p10 smooth)
   goals met: 57 of 71
40. (do-immersion-varnish p10 immersion-varnisher0 mauve smooth)
   deleted: (treatment p10 untreated) (colour p10 natural)
   added: (treatment p10 varnished) (colour p10 mauve)
   goals met: 58 of 71
41. (do-saw-small b4 p1 saw0 walnut rough s1 s0)
   deleted: (unused p1)
   added: (available p1) (wood p1 walnut) (surface-condition p1 rough) (colour p1 natural) (treatment p1 untreated) (boardsize b4 s0)
   goals met: 59 of 71
42. (do-glaze p1 glazer1 blue)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 glazed) (colour p1 blue)
   goals met: 60 of 71
43. (do-plane p1 planer0 rough blue glazed)
   deleted: (surface-condition p1 rough) (treatment p1 glazed) (colour p1 blue)
   added: (surface-condition p1 smooth) (treatment p1 untreated) (colour p1 natural)
   goals met: 59 of 71
44. (do-spray-varnish p1 spray-varnisher1 blue smooth)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 varnished) (colour p1 blue)
   goals met: 61 of 71
45. (do-glaze p0 glazer2 mauve)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 glazed) (colour p0 mauve)
   goals met: 62 of 71
46. (do-glaze p11 glazer1 blue)
   deleted: (treatment p11 untreated) (colour p11 natural)
   added: (treatment p11 glazed) (colour p11 blue)
   goals met: 64 of 71
47. (do-glaze p12 glazer0 white)
   deleted: (treatment p12 untreated) (colour p12 natural)
   added: (treatment p12 glazed) (colour p12 white)
   goals met: 66 of 71
48. (do-glaze p8 glazer1 blue)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 glazed) (colour p8 blue)
   goals met: 68 of 71
49. (do-plane p5 planer0 verysmooth natural colourfragments)
   deleted: (surface-condition p5 verysmooth) (treatment p5 colourfragments)
   added: (surface-condition p5 smooth) (treatment p5 untreated)
   goals met: 67 of 71
50. (do-grind p5 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p5 smooth)
   added: (surface-condition p5 verysmooth)
   goals met: 68 of 71
51. (do-immersion-varnish p5 immersion-varnisher1 blue verysmooth)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 varnished) (colour p5 blue)
   goals met: 70 of 71
52. (do-grind p14 grinder0 smooth white varnished colourfragments)
   deleted: (surface-condition p14 smooth) (treatment p14 varnished) (colour p14 white)
   added: (surface-condition p14 verysmooth) (treatment p14 colourfragments) (colour p14 natural)
   goals met: 69 of 71
53. (do-plane p14 planer0 verysmooth natural colourfragments)
   deleted: (surface-condition p14 verysmooth) (treatment p14 colourfragments)
   added: (surface-condition p14 smooth) (treatment p14 untreated)
   goals met: 68 of 71
54. (do-grind p14 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p14 smooth)
   added: (surface-condition p14 verysmooth)
   goals met: 69 of 71
55. (do-immersion-varnish p14 immersion-varnisher0 white verysmooth)
   deleted: (treatment p14 untreated) (colour p14 natural)
   added: (treatment p14 varnished) (colour p14 white)
   goals met: 71 of 71
